# SchedulableField Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
SchedulableField Constructor
SchedulableField Class See Also
---
Creates a new SchedulableField.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public SchedulableField()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
SchedulableField()
```

# See Also
SchedulableField Class
SchedulableField Overload
Autodesk.Revit.DB Namespace